app/Views/admin/tambah_user.php

                                    <select name="id_jam" id="id_jam" class="form-control" required>
                                        <?php
                                        $jamModel = new JamModel();
                                        $jamData = $jamModel->findAll();
---
SELECT *
FROM `tbl_jam`

                                        id='id_devisi' name="id_devisi" required>
                                        <?php
                                        $devisiModel = new DevisiModel();
                                        $devisiData = $devisiModel->findAll();
---
SELECT *
FROM `tbl_devisi`