app/Controllers/Absensi.php

    public function index()
    {
        $session = session();
        // Check if the user has the correct user level
        $level_user = $session->get('level_user');
        if ($level_user != 2) {
            // Redirect to the base URL or any other page you prefer
            return redirect()->to(base_url('absensi/kehadiran'));
        }
        $absenModel = new AbsenModel();
        $id_user = $session->get('id_user');
---
SELECT *
FROM `tbl_user`
WHERE `level_user` = 2

    public function berita_acara()
    {
        $session = session();
        // Pastikan user telah login dan sesi telah berisi data user dengan level_user
        if (!$session->has('id_user')) {
            return redirect()->to(base_url());
        }
        $userId = $session->get('id_user');

        // Periksa apakah user sudah melakukan "absen masuk" hari ini di database
        $today = date('Y-m-d');

        $beritaacara = $this->request->getPost('berita_acara');

        $data = [
            'berita_acara' => $beritaacara,
        ];
        $this->absenModel->where('id_user', $userId)
            ->where('DATE(jam_masuk)', $today)
            ->where('berita_acara', null) // Update hanya jika 'berita_acara' belum diisi
            ->set($data)
            ->update();
---
UPDATE `tbl_absen` SET `berita_acara` = '<p>edit foto</p>'
WHERE `id_user` = '2'
AND DATE(jam_masuk) = '2024-01-25'
AND `berita_acara` IS NULL