app/Controllers/Absensi.php

    public function absen_keluar()
    {
        $session = session();
        // Pastikan user telah login dan sesi telah berisi data user dengan level_user
        if (!$session->has('id_user')) {
            return redirect()->to(base_url());
        }
        $userId = $session->get('id_user');
        // Check if the user has already done "absen masuk" today
        $today = date('Y-m-d');
        $lastAbsenMasukDate = $session->get('last_absen_masuk_date');
        if ($lastAbsenMasukDate !== $today) {
            // User hasn't done "absen masuk" today, can't do "absen keluar"
            $session->setFlashdata('error_message', 'Anda belum melakukan absen masuk hari ini!');
            return redirect()->to(base_url());
        }
        // Check if the user has already done "absen keluar" today
        $absenMasukToday = $this->absenModel->where('id_user', $userId)
            ->where('jam_keluar', null)
            ->where('DATE(jam_masuk)', $today)
            ->first();
---
SELECT *
FROM `tbl_absen`
WHERE `id_user` = '2'
AND `jam_keluar` IS NULL
AND DATE(jam_masuk) = '2023-07-28'
 LIMIT 1