app/Controllers/Admin.php

    public function editUser($id_user)
    {
        $userModel = new UserModel();
        $devisiModel = new DevisiModel();

        // Ambil data user berdasarkan id_user
        $user = $userModel->find($id_user);

        // Pastikan data user dengan level_user = 2 hanya bisa diakses oleh admin
        if ($user['level_user'] == 2) {
            $data = [
                'judul' => 'Edit Pekerja Magang',
                'subjudul' => 'data-magang',
                'page' => 'admin/edit_user',
                'navbar' => 'admin/template/v_navbar.php',
                'footer' => 'admin/template/v_footer.php',
                'sidebar' => 'admin/template/v_sidebar.php',
                'users' => $user,
                'devisiData' => $devisiModel->findAll(), // Mengambil data devisi untuk dropdown
---
SELECT *
FROM `tbl_user`
WHERE `tbl_user`.`id_user` = '12'
SELECT *
FROM `tbl_devisi`

    public function updateUser($id_user)
    {
        $userModel = new UserModel();

        // Ambil data dari form
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');
        $nama = $this->request->getPost('nama');
        $alamat = $this->request->getPost('alamat');
        $no_telp = $this->request->getPost('no_telp');
        $devisi = $this->request->getPost('devisi');

        // Ambil data user berdasarkan id_user
        $userData = $userModel->find($id_user);
---
SELECT *
FROM `tbl_user`
WHERE `tbl_user`.`id_user` = '43'

            $data['password'] = $userData['password'];
        }

        $userModel->update($id_user, $data);
---
UPDATE `tbl_user` SET `username` = 'amat', `nama` = 'amat', `alamat` = 'amat', `no_telp` = 'amat', `id_devisi` = '13', `password` = '$2y$10$P2ou909jToe4GW5WOq1kMeLFBlJ.bNPLWRnD8qiEbUeX4WPs8XEem'
WHERE `tbl_user`.`id_user` IN ('12')