app/Controllers/Admin.php

SELECT *
FROM `tbl_user`
WHERE `level_user` = 2
---
    public function SemuaUser()
    {
        $userModel = new UserModel();

        // Ambil data user dengan level_user 2 dari database
        $users = $userModel->where('level_user', 2)->findAll();