app/Controllers/Admin.php

SELECT *
FROM `tbl_jam`
SELECT *
FROM `tbl_devisi`
---
    public function editUser($id_user)
    {
        $userModel = new UserModel();
        $devisiModel = new DevisiModel();
        $jamModel = new JamModel();


        // Ambil data user berdasarkan id_user
        $user = $userModel->find($id_user);

        // Pastikan data user dengan level_user = 2 || 3 hanya bisa diakses oleh admin
        if ($user['level_user'] == 2 || $user['level_user'] == 3) {
            $data = [
                'judul' => 'Edit Pekerja',
                'subjudul' => 'data-magang',
                'page' => 'admin/edit_user',
                'navbar' => 'admin/template/v_navbar.php',
                'footer' => 'admin/template/v_footer.php',
                'sidebar' => 'admin/template/v_sidebar.php',
                'users' => $user,
                'jam' => $jamModel->findAll(),
                'devisiData' => $devisiModel->findAll(),