app/Controllers/Dashboard.php

    public function index()
    {
        // Ambil data user dari session
        $session = session();
        $level_user = $session->get('level_user');

        if ($level_user == 1) {
            $devisiModel = new DevisiModel();
            $pegawaiModel = new UserModel();
            $absenModel = new AbsenModel();

            // Menghitung jumlah devisi berdasarkan jumlah id_devisi
            $jumlahDevisi = $devisiModel->countAllResults();
            // Menghitung jumlah pegawai dengan level_user = 2
            $jumlahPegawai = $pegawaiModel->where('level_user', 2)->orWhere('level_user', 3)->countAllResults();

            $currentDate = date('Y-m-d');

            // Menghitung jumlah absen masuk dan keluar pada hari ini
            $jumlahAbsenMasukKeluar = $absenModel->whereIn('keterangan', ['Masuk', 'Keluar'])
                ->where('DATE(jam_masuk)', $currentDate)
                ->orWhere('DATE(jam_keluar)', $currentDate)
                ->groupBy('id_user') // Group by user ID to count each user once
                ->countAllResults();

            // Menghitung jumlah absen keluar pada hari ini
            $jumlahAbsenKeluar = $absenModel->where('keterangan', 'Keluar')
                ->where('DATE(jam_keluar)', $currentDate)
                ->groupBy('id_user') // Group by user ID to count each user once
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_devisi`
SELECT COUNT(*) AS `numrows`
FROM `tbl_user`
WHERE `level_user` = 2
OR `level_user` = 3
SELECT COUNT(*) AS `numrows`
FROM (
SELECT *
FROM `tbl_absen`
WHERE `keterangan` IN ('Masuk','Keluar')
AND DATE(jam_masuk) = '2023-11-15'
OR DATE(jam_keluar) = '2023-11-15'
GROUP BY `id_user`
) CI_count_all_results
SELECT COUNT(*) AS `numrows`
FROM (
SELECT *
FROM `tbl_absen`
WHERE `keterangan` = 'Keluar'
AND DATE(jam_keluar) = '2023-11-15'
GROUP BY `id_user`
) CI_count_all_results


            // Check if the user has already done "absen masuk" today in the database
            $today = date('Y-m-d');
            $absenMasukToday = $this->absenModel->where('id_user', $userId)
                ->where('DATE(jam_masuk)', $today)
                ->first();
            $absenKeluarToday = $this->absenModel->where('id_user', $userId)
                ->where('DATE(jam_keluar)', $today)
                ->first();
            $beritaAcaraToday = $this->absenModel->where('id_user', $userId)
                ->where('berita_acara IS NOT NULL') // Check if 'berita_acara' is not null
                ->where('DATE(jam_masuk)', $today)
                ->first();
---
SELECT *
FROM `tbl_absen`
WHERE `id_user` = '47'
AND DATE(jam_masuk) = '2024-01-23'
 LIMIT 1
SELECT *
FROM `tbl_absen`
WHERE `id_user` = '47'
AND DATE(jam_keluar) = '2024-01-23'
 LIMIT 1
SELECT *
FROM `tbl_absen`
WHERE `id_user` = '47'
AND `berita_acara` IS NOT NULL
AND DATE(jam_masuk) = '2024-01-23'
 LIMIT 1


            // Validasi jam masuk
            $jamModel = new JamModel(); // Adjust with your actual JamModel class
            $jamData = $jamModel->find($idJam);
---
SELECT *
FROM `tbl_jam`
WHERE `tbl_jam`.`id_jam` = '2'