app/Controllers/Devisi.php

    public function TambahDevisi()
    {
        $devisiModel = new DevisiModel();

        // Ambil data semua divisi dari database
        $devisi = $devisiModel->findAll();
---
SELECT *
FROM `tbl_devisi`

    public function saveDivision()
    {
        $divisionModel = new DevisiModel();

        // Ambil data dari form
        $divisionName = $this->request->getPost('keterangan');

        // Simpan data divisi ke dalam database
        $data = [
            'keterangan' => $divisionName
            // Tambahkan kolom lain sesuai kebutuhan
        ];
        $divisionModel->insert($data);
---
INSERT INTO `tbl_devisi` (`devisi`) VALUES ('devisi')