app/Controllers/Jam.php

SELECT *
FROM `tbl_jam`
---
    public function index()
    {
        // Fetch time schedules from the database
        $jamModel = new JamModel();
        $schedules = $jamModel->findAll();