app/Models/AbsenModel.php

SELECT *
FROM `tbl_absen`
WHERE `id_user` = '47'
---
    public function getAbsenByUserId($id_user, $bulan = null, $tahun = null)
    {
        $builder = $this->where('id_user', $id_user);

        // Perform filtering based on bulan and tahun if they are provided
        if ($bulan !== null && $tahun !== null) {
            $builder->where('MONTH(jam_keluar)', $bulan);
            $builder->where('YEAR(jam_keluar)', $tahun);
        }

        return $builder->findAll();

SELECT `tbl_absen`.*, `user`.`username`, `user`.`password`, `user`.`nama`, `user`.`alamat`, `user`.`no_telp`, `devisi`.`keterangan`
FROM `tbl_absen`
JOIN `tbl_user` as `user` ON `user`.`id_user` = `tbl_absen`.`id_user`
JOIN `tbl_devisi` as `devisi` ON `devisi`.`id_devisi` = `user`.`id_devisi`
WHERE `user`.`level_user` = 2
---
    public function getAllAbsenWithUserInfo()
    {
        $results = $this->select('tbl_absen.*, user.username, user.password, user.nama, user.alamat, user.no_telp, devisi.devisi')
            ->join('tbl_user as user', 'user.id_user = tbl_absen.id_user')
            ->join('tbl_devisi as devisi', 'devisi.id_devisi = user.id_devisi')
            ->where('user.level_user', 2)
            ->findAll();